


console.log('HOMEWORK-01');


// Advanced
// Створіть шаблонний рядок та виведіть всі обчислення вчинені в Base частині домашнього завдання у вигляді одного рядка наступного вигляду:
// Максимальна ціна: 9999.99
// Мінімальна ціна: 1111.11
// Вартість всіх товарів: 1345.66
// ...і так далі





// Base
// Створіть 3 змінних з наступими значеннями: 15.678, 123.965, 90.2345. Ці змінні зберігають ціни на товари. Придумайте їм назви (товар можна придумати будь-який)

const milk = 15.678
const meat = 123.965
const cheese = 90.2345

// Використовуючи вбудований об'єкт Math – виведіть максимальне число

const bigger = Math.max( milk,meat,cheese );
console.log(bigger)

// Використовуючи вбудований об'єкт Math – виведіть мінімальне число

const minimal = Math.min( milk,meat,cheese );
console.log(minimal)

// Складіть вартість всіх товарів, помістіть її в змінну та виведіть цю суму

const sum = milk+meat+cheese; 
console.log(sum)

// Відкиньте копійки у всіх товарів, потім – складіть цілу частину вартості кожного товару між собою. Округлення використовувати в МЕНЬШУ сторону.

 const sumMin = Math.floor(milk) + Math.floor(meat) + Math.floor(cheese);
console.log(sumMin )


// Виведіть суму товарів округлену до сотень. (Наприклад якщо вийшло 260, то виведіть 300)

const sumBig =Math.round(sum/100) * 100;
console.log(sumBig)

// Виведіть булеве значення: чи є сума всіх товарів (округлена в меншу сторону) парним чи непарним числом?

console.log(sumMin%2===0)
// ! можно так еще
// ! const even = !(roundedTotalCost % 2);
// ! console.log(`even: ${even}`);

// Виведіть суму решти, при оплаті всіх товарів (без округлення), якщо клієнт платить 500 грн.

const money = (500);

const change = (money-sum);

console.log(change)

// Виведіть середнє значення цін, округлене до другого знаку після коми

// const averagePrice = 

let midd= +(sum / 3).toFixed(2); //! + меняет тип на число

console.log(midd)

// (Більш складне) Створіть змінну, в якої збережіть випадкову знижку (використовуйте функцію Math.random).



 const random = Math.round(Math.random() * 101);  // ! const discount = Math.trunc(Math.random() * 100);
 console.log(random)                                    // ! console.log(` discount: ${discount}%`); в процентах

 // Зробіть клієнту випадкову знижку та виведіть суму до оплати округлену до 2 знаків після коми.

 const discount = (sum - (sum * random / 100)).toFixed(2);

// Виведіть чистий прибуток, якщо клієнт заплатив зі знижкою та собівартість товарів рівно в два рази нижче їх ціни?
// (Приклад: ціна була 260.66, знижка склала 10%, клієнт заплатив на 26 меньше, собівартість = 260 / 2 -> 130. Чистий прибуток = 130 - 26 -> 104) (Приклад 2: ціна була 100, знижка склала 90%, клієнт заплатив на 90 меньше, собівартість = 100 / 2 -> 50. Чистий прибуток = 50 - 90 -> -40)


const profit = Math.round(sum / 2 - (sum * random / 100));

console.log(profit);	




	

console.log(
	`
	Максимальная цена: ${bigger} <br>
	Минимальная цена: ${minimal} <br>
	Общая стоимость: ${sum} <br>
	Суммарная цена: ${sumMin} <br>
	Суммарная цена (округленная): ${sumBig} <br>
	Четность: ${sumMin%2===0} <br>
	Остача: ${change} <br>
	Среднее значение: ${midd} <br>
	Скидка: ${random} <br>
	Чистая прибыль: ${profit} <br>
	`
);


//! Замечания

// Переприсвоювати змінні можна, але це треба робити з розумом і причиною
// Взагалі варто завжди оголошувати змінну через const, і якщо все ж з'явилась потреба змінювати значення, тоді переписати на let

// Щодо твоєї роботи, то є кілька зауважень
// - Не всі змінні ти оголошуєш правильно, місцями забуваєш додавати ключове слово const або let

// milk = Math.floor(15.678)
// meat= Math.floor(123.965)
// cheese = Math.floor(90.2345)
// sumMin = milk+meat+cheese

// Ти на початку оголошував змінні з цифрами (15.678, 123.965, 90,2345), щоб потім по всьому коду їх не писати, а тільки звертатись до назви змінної

// Який сенс переприсвоювання, якщо ти можеш відразу підсумувати заокруглені значення, наприклад const sumMin = Math.floor(milk) + Math.floor(meat) + Math.floor(cheese);
// Те саме зауваження і до всіх інших переприсвоєнь!

// milk = Math.round(15.678)
// meat= Math.round(123.965)
// cheese = Math.round(90.2345)
// sumBig = milk+meat+cheese
// Неправильно виконане завдання. Тобі потрібно використати підраховану раніше суму і заокруглити її до сотень, тобто якщо в тебе сума вийде 260 - то ти повинен вивести 300

// milkTwo = Math.round(15.678100)/100
// meatTwo= Math.round(123.965100)/100
// cheeseTwo = Math.round(90.2345*100)/100
// let midd= Math.round = (milkTwo+meatTwo+cheeseTwo)/3

// тут потрібно робити все навпаки, використати пораховану раніше суму, знайти середнє значення і вже тоді приводити до 2 знаків після крапки
// Раджу використовувати toFixed(), замість множення і ділення на 100

// let random = Math.floor(Math.random() * 101)
// console.log(random)
// let discount= (sum-random)

// тобі спершу потрібно вирахувати знижку по відсотку від загальної суми і вже тоді віднімати від цієї ж суми
// Це саме стосується профіту

// Хорошою практикою є ставити крапки з комою вкінця рядка, який виконує якусь дію
// останній console.log варто перенести частково з нового рядка, так як важко читається
// // 






































