


console.log('HOMEWORK-01');

// Base

let milk = 15.678
let meat = 123.965
let cheese = 90.2345

const bigger = Math.max( milk,meat,cheese )
console.log(bigger)

const minimal = Math.min( milk,meat,cheese )
console.log(minimal)

let sum = milk+meat+cheese 
console.log(sum)

 milk = Math.floor(15.678)
 meat= Math.floor(123.965)
 cheese = Math.floor(90.2345)

sumMin = milk+meat+cheese 
console.log(sumMin )

milk = Math.round(15.678)
meat= Math.round(123.965)
cheese = Math.round(90.2345)

sumBig = milk+meat+cheese 
console.log(sumBig)



console.log(sumMin%2===0)

let minus = (500-sum)

console.log(minus)

milkTwo = Math.round(15.678*100)/100
meatTwo= Math.round(123.965*100)/100
cheeseTwo = Math.round(90.2345*100)/100

let midd= Math.round = (milkTwo+meatTwo+cheeseTwo)/3

console.log(midd)

let random = Math.floor(Math.random() * 101)
console.log(random)

let discount= (sum-random)

console.log(discount.toFixed(2))

let profit = ((sum/2)-random)
console.log(profit)


	

console.log('Максимальная цена:' + bigger , 'Минимальная цена:' + minimal, 'Стоимость всех товаров :' + sum , 'Сумма с округлением в меншую сторону:' + sumMin, 'Сумма с округлением в ,большую сторону:' + sumBig , 'Проверка 500:' + minus,'Среднее значение:' + midd, 'Сумма скдки:' + random,'стоимость со скидкой:' + discount.toFixed(2),'Прибыль:' +profit)





















// Base
// (!) Домашнє завдання потрібно здавати у вигляді сторінки на GITPAGES. Відео про те, як здавати ДЗ

// Створіть 3 змінних з наступими значеннями: 15.678, 123.965, 90.2345. Ці змінні зберігають ціни на товари. Придумайте їм назви (товар можна придумати будь-який)

// (!) При виводі можна використовувати функції console.log або document.writeln

// Використовуючи вбудований об'єкт Math – виведіть максимальне число
// Використовуючи вбудований об'єкт Math – виведіть мінімальне число
// Складіть вартість всіх товарів, помістіть її в змінну та виведіть цю суму
// Відкиньте копійки у всіх товарів, потім – складіть цілу частину вартості кожного товару між собою. Округлення використовувати в МЕНЬШУ сторону.
// Виведіть суму товарів округлену до сотень. (Наприклад якщо вийшло 260, то виведіть 300)
// Виведіть булеве значення: чи є сума всіх товарів (округлена в меншу сторону) парним чи непарним числом?
// Виведіть суму решти, при оплаті всіх товарів (без округлення), якщо клієнт платить 500 грн.
// Виведіть середнє значення цін, округлене до другого знаку після коми
// (Більш складне) Створіть змінну, в якої збережіть випадкову знижку (використовуйте функцію Math.random).
// Зробіть клієнту випадкову знижку та виведіть суму до оплати округлену до 2 знаків після коми.
// Виведіть чистий прибуток, якщо клієнт заплатив зі знижкою та собівартість товарів рівно в два рази нижче їх ціни?
// (Приклад: ціна була 260.66, знижка склала 10%, клієнт заплатив на 26 меньше, собівартість = 260 / 2 -> 130. Чистий прибуток = 130 - 26 -> 104) (Приклад 2: ціна була 100, знижка склала 90%, клієнт заплатив на 90 меньше, собівартість = 100 / 2 -> 50. Чистий прибуток = 50 - 90 -> -40)

// Advanced
// Створіть шаблонний рядок та виведіть всі обчислення вчинені в Base частині домашнього завдання у вигляді одного рядка наступного вигляду:
// Максимальна ціна: 9999.99
// Мінімальна ціна: 1111.11
// Вартість всіх товарів: 1345.66
// ...і так далі




















